Repository: brenard/zxcvbn-python
Catalog: zxcvbn/locale/*/LC_MESSAGES/zxcvbn.po
Languages: fr

source: Use a few words, avoid common phrases.
fr: Utiliser quelques mots, éviter les phrases communes.

source: No need for symbols, digits, or uppercase letters.
fr: Les symboles, les chiffres ou les majuscules sont inutiles.

source: Add another word or two. Uncommon words are better.
fr: Ajouter un ou deux autres mots. Les mots les moins communs sont préférables.

source: Straight rows of keys are easy to guess.
fr: Les rangées de touches du clavier sont faciles à deviner.

source: Short keyboard patterns are easy to guess.
fr: Les courtes suites de touches du clavier sont faciles à deviner.

source: Use a longer keyboard pattern with more turns.
fr: Utilisez une suite de touches du clavier plus long avec plus de tours.

source: Repeats like "aaa" are easy to guess.
fr: Les répétitions comme "aaa" sont faciles à deviner.

source: Repeats like "abcabcabc" are only slightly harder to guess than "abc".
fr: Les répétitions comme "abcabcabc" ne sont que légèrement plus simples à deviner que "abc".

source: Avoid repeated words and characters.
fr: Évitez la répétition de mots ou de caractères.

source: Sequences like "abc" or "6543" are easy to guess.
fr: Les séquences comme "abc" ou "6543" sont faciles à deviner.

source: Avoid sequences.
fr: Évitez les séquences.

source: Recent years are easy to guess.
fr: Les années récentes sont faciles à deviner.

source: Avoid recent years.
fr: Évitez les années récentes.

source: Avoid years that are associated with you.
fr: Évitez les années qui vont sont associées.

source: Dates are often easy to guess.
fr: Les dates sont souvent faciles à deviner.

source: Avoid dates and years that are associated with you.
fr: Évitez les dates et les années qui vous sont associées.

source: This is a top-10 common password.
fr: Ce mot de passe fait parti des 10 mots de passe les plus utilisés.

source: This is a top-100 common password.
fr: Ce mot de passe fait parti des 100 mots de passe les plus utilisés.

source: This is a very common password.
fr: Ce mot de passe est très commun.

source: This is similar to a commonly used password.
fr: Ceci est similaire à un mot de passe couramment utilisé.

source: A word by itself is easy to guess.
fr: Un simple mot est facile à deviner.

source: Names and surnames by themselves are easy to guess.
fr: Les noms et prénoms sont faciles à deviner.

source: Common names and surnames are easy to guess.
fr: Les noms communs sont faciles à deviner.

source: Capitalization doesn't help very much.
fr: Les majuscules n'aident pas beaucoup.

source: All-uppercase is almost as easy to guess as all-lowercase.
fr: Les mots de passe tout en majuscule sont presque aussi faciles à deviner que ceux tout en minuscule.

source: Reversed words aren't much harder to guess.
fr: Les mots inversés ne sont pas beaucoup plus difficiles à deviner.

source: Predictable substitutions like '@' instead of 'a' don't help very much.
fr: Des substitutions prévisibles telles que "@" au lieu de "a" n'aident pas beaucoup.
